Project/Toir/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/гкс_СоответствияДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоответствияДолжностейИКвалификаций</name>
  <comment>TOIR20-181</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает квалификацию по организации, подразделению и должности,
//
// Параметры:
//	- Организация - СправочникСсылка.Организации - Организация.
//	- Подразделение - СправочникСсылка.СтруктураПредприятия - Подразделение.
//	- Должность - СправочникСсылка.Должности - Должность.
//
// Возвращаемое значение:
// СправочникСсылка.торо_КвалификацииРемонтногоПерсонала
//
Функция КвалификацияДолжности(Организация, Подразделение, Должность) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_КвалификацияДолжности();
			
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Должность", Должность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.Квалификация;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса_КвалификацияДолжности() 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Квалификации.Квалификация КАК Квалификация
		|ИЗ
		|	РегистрСведений.гкс_СоответствияДолжностейИКвалификаций.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Подразделение = &Подразделение
		|				И Должность = &Должность) КАК Квалификации";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли
